Tekla Open API Reference for Tekla Structures 2025
WpfSaveLoad Properties
The WpfSaveLoad type exposes the following members.
Properties
Name | Description
HelpFileType
 Gets or sets the help file type.
HelpKeyword
 Gets or sets the HelpKeyword that the help file should be opened for. If you do not provide a HelpKeyword and HelpUrl is not set, the default start page for Tekla Structures Help viewer is displayed.
HelpUrl
 Gets or sets the HelpUrl where the help file is located. If you do not provide a HelpUrl, the Tekla Structures help viewer will be displayed with given HelpKeyword.
SaveAsText
 Gets or sets the text in the SaveAs text box.
SaveLoadText
 Gets the currently selected file name in the Save/Load combo box.
SelectedFileName
 Gets or sets the text in the SaveAs text box.
UserDefinedHelpFilePath
 Gets or sets the file path where the UserDefined help file is located. If you do not provide a UserDefinedHelpFilePath, the general Help file, help.chm, will be displayed.
Top
See Also
Reference
WpfSaveLoad Class
Tekla.Structures.Dialog.UIControls Namespace